10/data/attachments/e454b0123a279f71.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_335b587d-4b17-491c-beab-a5e09d5c7364</nif:username>
            <nif:friendToBeAdded>Amy_sense_Friend_63219_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>